Тестовая_база_ERP_14/src/InformationRegisters/РегистрацияЗемельныхУчастков/РегистрацияЗемельныхУчастков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацияЗемельныхУчастков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВключатьВНалоговуюБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодКатегорииЗемель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОбщаяСобственность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоляВПравеОбщейСобственностиЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляВПравеОбщейСобственностиЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖилищноеСтроительство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаПроектирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииПравНаОбъектНедвижимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостановкаНаУчетВНалоговомОргане</name>
    <type>
      <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>НалоговыйОрган</name>
    <comment>Код налогового органа (по месту регистрации имущества)</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяЛьготаПоНалоговойБазе</name>
    <type>
      <types>EnumRef.ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу</types>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УменьшениеНалоговойБазыПоСтатье391</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УменьшениеНалоговойБазыНаСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоляНеОблагаемойНалогомПлощадиЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляНеОблагаемойНалогомПлощадиЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеОблагаемаяНалогомСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>СниженнаяНалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентУменьшенияСуммыНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУменьшенияСуммыНалога</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидЗаписиОРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/РегистрацияЗемельныхУчастков/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если Не ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПередЗаписью.Период КАК Период,
	|	ТаблицаПередЗаписью.Организация КАК Организация,
	|	ТаблицаПередЗаписью.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаПередЗаписью.ВключатьВНалоговуюБазу КАК ВключатьВНалоговуюБазу,
	|	ТаблицаПередЗаписью.КодКатегорииЗемель КАК КодКатегорииЗемель,
	|	ТаблицаПередЗаписью.КадастровыйНомер КАК КадастровыйНомер,
	|	ТаблицаПередЗаписью.КадастроваяСтоимость КАК КадастроваяСтоимость,
	|	ТаблицаПередЗаписью.ОбщаяСобственность КАК ОбщаяСобственность,
	|	ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
	|	ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
	|	ТаблицаПередЗаписью.ЖилищноеСтроительство КАК ЖилищноеСтроительство,
	|	ТаблицаПередЗаписью.ДатаНачалаПроектирования КАК ДатаНачалаПроектирования,
	|	ТаблицаПередЗаписью.ДатаРегистрацииПравНаОбъектНедвижимости КАК ДатаРегистрацииПравНаОбъектНедвижимости,
	|	ТаблицаПередЗаписью.ПостановкаНаУчетВНалоговомОргане КАК ПостановкаНаУчетВНалоговомОргане,
	|	ТаблицаПередЗаписью.НалоговыйОрган КАК НалоговыйОрган,
	|	ТаблицаПередЗаписью.КодПоОКТМО КАК КодПоОКТМО,
	|	ТаблицаПередЗаписью.КодПоОКАТО КАК КодПоОКАТО,
	|	ТаблицаПередЗаписью.КБК КАК КБК,
	|	ТаблицаПередЗаписью.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ТаблицаПередЗаписью.НалоговаяЛьготаПоНалоговойБазе КАК НалоговаяЛьготаПоНалоговойБазе,
	|	ТаблицаПередЗаписью.КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395 КАК КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395,
	|	ТаблицаПередЗаписью.КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391 КАК КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391,
	|	ТаблицаПередЗаписью.УменьшениеНалоговойБазыПоСтатье391 КАК УменьшениеНалоговойБазыПоСтатье391,
	|	ТаблицаПередЗаписью.УменьшениеНалоговойБазыНаСумму КАК УменьшениеНалоговойБазыНаСумму,
	|	ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЧислитель КАК ДоляНеОблагаемойНалогомПлощадиЧислитель,
	|	ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЗнаменатель КАК ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
	|	ТаблицаПередЗаписью.НеОблагаемаяНалогомСумма КАК НеОблагаемаяНалогомСумма,
	|	ТаблицаПередЗаписью.СниженнаяНалоговаяСтавка КАК СниженнаяНалоговаяСтавка,
	|	ТаблицаПередЗаписью.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшенияСуммыНалога,
	|	ТаблицаПередЗаписью.СуммаУменьшенияСуммыНалога КАК СуммаУменьшенияСуммыНалога
	|ПОМЕСТИТЬ РегистрацияЗемельныхУчастковПередЗаписью
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков КАК ТаблицаПередЗаписью
	|ГДЕ
	|	ТаблицаПередЗаписью.Регистратор = &Регистратор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Период            КАК Период,
	|	Таблица.Организация       КАК Организация,
	|	Таблица.ОсновноеСредство  КАК ОсновноеСредство,
	|	ИСТИНА                    КАК ОтражатьВРеглУчете,
	|	ЛОЖЬ                      КАК ОтражатьВУпрУчете,
	|	&Регистратор              КАК Документ
	|ПОМЕСТИТЬ РегистрацияЗемельныхУчастковИзменение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(ТаблицаПередЗаписью.Период, МЕСЯЦ) КАК Период,
	|		ТаблицаПередЗаписью.Организация КАК Организация,
	|		ТаблицаПередЗаписью.ОсновноеСредство КАК ОсновноеСредство
	|	ИЗ
	|		РегистрацияЗемельныхУчастковПередЗаписью КАК ТаблицаПередЗаписью
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК ТаблицаПриЗаписи
	|			ПО (ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация)
	|				И (ТаблицаПриЗаписи.ОсновноеСредство = ТаблицаПередЗаписью.ОсновноеСредство)
	|				И (ТаблицаПриЗаписи.Регистратор = &Регистратор)
	|	ГДЕ
	|		(ТаблицаПередЗаписью.ВключатьВНалоговуюБазу <> ЕСТЬNULL(ТаблицаПриЗаписи.ВключатьВНалоговуюБазу, НЕОПРЕДЕЛЕНО)
	|			ИЛИ ТаблицаПередЗаписью.КодКатегорииЗемель <> ТаблицаПриЗаписи.КодКатегорииЗемель
	|			ИЛИ ТаблицаПередЗаписью.КадастровыйНомер <> ТаблицаПриЗаписи.КадастровыйНомер
	|			ИЛИ ТаблицаПередЗаписью.КадастроваяСтоимость <> ТаблицаПриЗаписи.КадастроваяСтоимость
	|			ИЛИ ТаблицаПередЗаписью.ОбщаяСобственность <> ТаблицаПриЗаписи.ОбщаяСобственность
	|			ИЛИ ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЧислитель <> ТаблицаПриЗаписи.ДоляВПравеОбщейСобственностиЧислитель
	|			ИЛИ ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЗнаменатель <> ТаблицаПриЗаписи.ДоляВПравеОбщейСобственностиЗнаменатель
	|			ИЛИ ТаблицаПередЗаписью.ЖилищноеСтроительство <> ТаблицаПриЗаписи.ЖилищноеСтроительство
	|			ИЛИ ТаблицаПередЗаписью.ДатаНачалаПроектирования <> ТаблицаПриЗаписи.ДатаНачалаПроектирования
	|			ИЛИ ТаблицаПередЗаписью.ДатаРегистрацииПравНаОбъектНедвижимости <> ТаблицаПриЗаписи.ДатаРегистрацииПравНаОбъектНедвижимости
	|			ИЛИ ТаблицаПередЗаписью.ПостановкаНаУчетВНалоговомОргане <> ТаблицаПриЗаписи.ПостановкаНаУчетВНалоговомОргане
	|			ИЛИ ТаблицаПередЗаписью.НалоговыйОрган <> ТаблицаПриЗаписи.НалоговыйОрган
	|			ИЛИ ТаблицаПередЗаписью.КодПоОКТМО <> ТаблицаПриЗаписи.КодПоОКТМО
	|			ИЛИ ТаблицаПередЗаписью.КодПоОКАТО <> ТаблицаПриЗаписи.КодПоОКАТО
	|			ИЛИ ТаблицаПередЗаписью.КБК <> ТаблицаПриЗаписи.КБК
	|			ИЛИ ТаблицаПередЗаписью.НалоговаяСтавка <> ТаблицаПриЗаписи.НалоговаяСтавка
	|			ИЛИ ТаблицаПередЗаписью.НалоговаяЛьготаПоНалоговойБазе <> ТаблицаПриЗаписи.НалоговаяЛьготаПоНалоговойБазе
	|			ИЛИ ТаблицаПередЗаписью.КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395 <> ТаблицаПриЗаписи.КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395
	|			ИЛИ ТаблицаПередЗаписью.КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391 <> ТаблицаПриЗаписи.КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391
	|			ИЛИ ТаблицаПередЗаписью.УменьшениеНалоговойБазыПоСтатье391 <> ТаблицаПриЗаписи.УменьшениеНалоговойБазыПоСтатье391
	|			ИЛИ ТаблицаПередЗаписью.УменьшениеНалоговойБазыНаСумму <> ТаблицаПриЗаписи.УменьшениеНалоговойБазыНаСумму
	|			ИЛИ ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЧислитель <> ТаблицаПриЗаписи.ДоляНеОблагаемойНалогомПлощадиЧислитель
	|			ИЛИ ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЗнаменатель <> ТаблицаПриЗаписи.ДоляНеОблагаемойНалогомПлощадиЗнаменатель
	|			ИЛИ ТаблицаПередЗаписью.НеОблагаемаяНалогомСумма <> ТаблицаПриЗаписи.НеОблагаемаяНалогомСумма
	|			ИЛИ ТаблицаПередЗаписью.СниженнаяНалоговаяСтавка <> ТаблицаПриЗаписи.СниженнаяНалоговаяСтавка
	|			ИЛИ ТаблицаПередЗаписью.ПроцентУменьшенияСуммыНалога <> ТаблицаПриЗаписи.ПроцентУменьшенияСуммыНалога
	|			ИЛИ ТаблицаПередЗаписью.СуммаУменьшенияСуммыНалога <> ТаблицаПриЗаписи.СуммаУменьшенияСуммыНалога
	
	|			ИЛИ НАЧАЛОПЕРИОДА(ТаблицаПриЗаписи.Период, МЕСЯЦ) <> НАЧАЛОПЕРИОДА(ТаблицаПередЗаписью.Период, МЕСЯЦ)
	|			ИЛИ ТаблицаПриЗаписи.Организация ЕСТЬ NULL)
	|		И ТаблицаПередЗаписью.Организация.ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(ТаблицаПриЗаписи.Период, МЕСЯЦ),
	|		ТаблицаПриЗаписи.Организация,
	|		ТаблицаПриЗаписи.ОсновноеСредство
	|	ИЗ
	|		РегистрСведений.РегистрацияЗемельныхУчастков КАК ТаблицаПриЗаписи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрацияЗемельныхУчастковПередЗаписью КАК ТаблицаПередЗаписью
	|			ПО ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация
	|				И ТаблицаПриЗаписи.ОсновноеСредство = ТаблицаПередЗаписью.ОсновноеСредство
	|	ГДЕ
	|		(ТаблицаПриЗаписи.ВключатьВНалоговуюБазу <> ЕСТЬNULL(ТаблицаПередЗаписью.ВключатьВНалоговуюБазу, НЕОПРЕДЕЛЕНО)
	|			ИЛИ ТаблицаПередЗаписью.КодКатегорииЗемель <> ТаблицаПриЗаписи.КодКатегорииЗемель
	|			ИЛИ ТаблицаПередЗаписью.КадастровыйНомер <> ТаблицаПриЗаписи.КадастровыйНомер
	|			ИЛИ ТаблицаПередЗаписью.КадастроваяСтоимость <> ТаблицаПриЗаписи.КадастроваяСтоимость
	|			ИЛИ ТаблицаПередЗаписью.ОбщаяСобственность <> ТаблицаПриЗаписи.ОбщаяСобственность
	|			ИЛИ ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЧислитель <> ТаблицаПриЗаписи.ДоляВПравеОбщейСобственностиЧислитель
	|			ИЛИ ТаблицаПередЗаписью.ДоляВПравеОбщейСобственностиЗнаменатель <> ТаблицаПриЗаписи.ДоляВПравеОбщейСобственностиЗнаменатель
	|			ИЛИ ТаблицаПередЗаписью.ЖилищноеСтроительство <> ТаблицаПриЗаписи.ЖилищноеСтроительство
	|			ИЛИ ТаблицаПередЗаписью.ДатаНачалаПроектирования <> ТаблицаПриЗаписи.ДатаНачалаПроектирования
	|			ИЛИ ТаблицаПередЗаписью.ДатаРегистрацииПравНаОбъектНедвижимости <> ТаблицаПриЗаписи.ДатаРегистрацииПравНаОбъектНедвижимости
	|			ИЛИ ТаблицаПередЗаписью.ПостановкаНаУчетВНалоговомОргане <> ТаблицаПриЗаписи.ПостановкаНаУчетВНалоговомОргане
	|			ИЛИ ТаблицаПередЗаписью.НалоговыйОрган <> ТаблицаПриЗаписи.НалоговыйОрган
	|			ИЛИ ТаблицаПередЗаписью.КодПоОКТМО <> ТаблицаПриЗаписи.КодПоОКТМО
	|			ИЛИ ТаблицаПередЗаписью.КодПоОКАТО <> ТаблицаПриЗаписи.КодПоОКАТО
	|			ИЛИ ТаблицаПередЗаписью.КБК <> ТаблицаПриЗаписи.КБК
	|			ИЛИ ТаблицаПередЗаписью.НалоговаяСтавка <> ТаблицаПриЗаписи.НалоговаяСтавка
	|			ИЛИ ТаблицаПередЗаписью.НалоговаяЛьготаПоНалоговойБазе <> ТаблицаПриЗаписи.НалоговаяЛьготаПоНалоговойБазе
	|			ИЛИ ТаблицаПередЗаписью.КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395 <> ТаблицаПриЗаписи.КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395
	|			ИЛИ ТаблицаПередЗаписью.КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391 <> ТаблицаПриЗаписи.КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391
	|			ИЛИ ТаблицаПередЗаписью.УменьшениеНалоговойБазыПоСтатье391 <> ТаблицаПриЗаписи.УменьшениеНалоговойБазыПоСтатье391
	|			ИЛИ ТаблицаПередЗаписью.УменьшениеНалоговойБазыНаСумму <> ТаблицаПриЗаписи.УменьшениеНалоговойБазыНаСумму
	|			ИЛИ ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЧислитель <> ТаблицаПриЗаписи.ДоляНеОблагаемойНалогомПлощадиЧислитель
	|			ИЛИ ТаблицаПередЗаписью.ДоляНеОблагаемойНалогомПлощадиЗнаменатель <> ТаблицаПриЗаписи.ДоляНеОблагаемойНалогомПлощадиЗнаменатель
	|			ИЛИ ТаблицаПередЗаписью.НеОблагаемаяНалогомСумма <> ТаблицаПриЗаписи.НеОблагаемаяНалогомСумма
	|			ИЛИ ТаблицаПередЗаписью.СниженнаяНалоговаяСтавка <> ТаблицаПриЗаписи.СниженнаяНалоговаяСтавка
	|			ИЛИ ТаблицаПередЗаписью.ПроцентУменьшенияСуммыНалога <> ТаблицаПриЗаписи.ПроцентУменьшенияСуммыНалога
	|			ИЛИ ТаблицаПередЗаписью.СуммаУменьшенияСуммыНалога <> ТаблицаПриЗаписи.СуммаУменьшенияСуммыНалога
	|			ИЛИ НАЧАЛОПЕРИОДА(ТаблицаПриЗаписи.Период, МЕСЯЦ) <> НАЧАЛОПЕРИОДА(ТаблицаПередЗаписью.Период, МЕСЯЦ)
	|			ИЛИ ТаблицаПередЗаписью.Организация ЕСТЬ NULL)
	|		И ТаблицаПриЗаписи.Организация.ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|		И ТаблицаПриЗаписи.Регистратор = &Регистратор
	|
	|	) КАК Таблица
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегистрацияЗемельныхУчастковПередЗаписью";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();
	
	СтруктураВременныеТаблицы.Вставить("РегистрацияЗемельныхУчастковИзменение", Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
